tutorials/overset/flowTests/bodyFittedCylinderCircular/constant/oversetMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          oversetMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolation
{
    type injection;
}

regions
(
    // Background
    {
        index 0;

        // Donor regions
        donorRegions ( 1 );

        // Names or patches that determine hole cells
        holePatches ();

        fringe
        {
            type manual;
            holes       "backHole";
            acceptors   "backFringe";
        }
    }

    // Cylinder
    {
        index 1;

        donorRegions ( 0 );

        holePatches  ( cylinder );

        fringe
        {
            type faceCells;
            patches ( outerCylinder );
        }
    }
);


// ************************************************************************* //
